from random import choice

from django.contrib import admin
from django.contrib.admin.apps import SimpleAdminConfig


A_WORDS = ['Абажур', 'Абревіатура', 'Абзац', 'Абітурієнт', 'Абонемент', 'Абонент', 'Абордаж', 'Абориген', 'Абрикос', 'Абстрактний', 'Абстракція', 'Авангард', 'Авантюра', 'Аварія', 'Авіадесант', 'Авіакомпанія', 'Авиапочта', 'Авіапромисловість', 'Авіасалон', 'Австралія', 'Автобіографія', 'Автобус', 'Автогараж', 'Автограф', 'Автоколона', 'Автоматизація', 'Автомобіль', 'Автономний', 'Автопілот', 'Автор', 'Авторитет', 'Автострада', 'Агентство', 'Агрегат', 'Агроном', 'Адекватний', 'Адміністрація', 'Адмірал', 'Адреса', 'Ажіотаж', 'Азія', 'Айсберг', 'Академія', 'Акація', 'Акваланг', 'Аквалангіст', 'Аквамарин', 'Акварель', 'Акваріум', 'Акваторія', 'Акліматизація', 'Акомпанемент', 'Акомпаніатор', 'Акомпануватиме', 'Акорд', 'Акордеон', 'Акумулятор', 'Акуратно', 'Акуратний', 'Аксесуар', 'Активний', 'Актуальний', 'Акустика', 'Алгоритм', 'Алегорія', 'Алергія', 'Алея', 'Алігатор', 'Алітерація', 'Алмаз', 'Алмазний', 'Алфавіт', 'Альбатрос', 'Альбом', 'Альманах', 'Альпініст', 'Альтернатива', 'Альфа-промені', 'Алюмінієвий', 'Алюміній', 'Амбразура', 'Америка', 'Аморальний', 'Амплітуда', 'Амплуа', 'Амфітеатр', 'Аналітичний', 'Ананас', 'Анафора', 'Анахронізм', 'Анекдот', 'Аннали', 'Анотація', 'Анулювати', 'Аномальний', 'Ансамбль', 'Антагонізм', 'Антарктида', 'Антенна', 'Антициклон', 'Антологія', 'Апельсин', 'Аплодувати', 'Апогей', 'Аполітичний', 'Апостол', 'Апофеоз', 'Апарат', 'Апаратура', 'Апендицит', 'Апетит', 'Аплікація', 'Аптека', 'Аргумент', 'Арена', 'Аристократ', 'Аритмія', 'Арматура', 'Аромат', 'Арсенал', 'Артеміда', 'Артикуляція', 'Артилерія', 'Артист', 'Артистка', 'Архаїзм', 'Архаїчний', 'Архів', 'Архітектура', 'Асесор', 'Асесор', 'Асиметрія', 'Асамблея', 'Асиміляція', 'Асистент', 'Асортимент', 'Асоціація', 'Астронавт', 'Асфальт', 'Атака', 'Атласний', 'Атлет', 'Атмосфера', 'Атестат', 'Атракціон', 'Аудиторія', 'Афіша', 'Африка']


class MyAdmin(admin.AdminSite):
    site_title = "СОВА"

    def site_header(self, name="Все универы"):
        return "Студентский Освітній Виклик " + choice(A_WORDS) + " | " + name

    def each_context(self, req):
        r = super().each_context(req)
        if getattr(req.user, 'univer', None):
            r['site_header'] = r['site_header'](req.user.univer.name)
        return r


class MyAdminConfig(SimpleAdminConfig):
    default_site = 'mainapp.admin.MyAdmin'

    def ready(self):
        super().ready()
        from . import models
